dretay/stm32f103cb_alarm_clock/Core/Src/STM32SAM.c
//some flags
static const unsigned char tab36376[] =
{
  0, 0, 0, 0, 0, 0, 0, 0, // 0-7
  0, 0, 0, 0, 0, 0, 0, 0, // 8-15
  0, 0, 0, 0, 0, 0, 0, 0,
  0, 0, 0, 0, 0, 0, 0, 0,
  0, 2, 2, 2, 2, 2, 2, 130, // ' ', '!'
  0, 0, 2, 2, 2, 2, 2, 2,
  3, 3, 3, 3, 3, 3, 3, 3,
  3, 3, 2, 2, 2, 2, 2, 2,
  2, 192, 168, 176, 172, 192, 160, 184, // '@', 'A'
  160, 192, 188, 160, 172, 168, 172, 192,
  160, 160, 172, 180, 164, 192, 168, 168,
  176, 192, 188, 0, 0, 0, 2, 0, // 'X', 'Y', 'Z', '[',
  32, 32, 155, 32, 192, 185, 32, 205,
  163, 76, 138, 142
};

static const unsigned char rules[] =
{
  ']', 'A' | 0x80,
  ' ', '(', 'A', '.', ')',                    '=', 'E', 'H', '4', 'Y', '.', ' ' | 0x80,
  '(', 'A', ')', ' ',                        '=', 'A', 'H' | 0x80,
  ' ', '(', 'A', 'R', 'E', ')', ' ',            '=', 'A', 'A', 'R' | 0x80,
  ' ', '(', 'A', 'R', ')', 'O',                '=', 'A', 'X', 'R' | 0x80,
  '(', 'A', 'R', ')', '#',                    '=', 'E', 'H', '4', 'R' | 0x80,
  ' ', '^', '(', 'A', 'S', ')', '#',            '=', 'E', 'Y', '4', 'S' | 0x80,
  '(', 'A', ')', 'W', 'A',                    '=', 'A', 'X' | 0x80,
  '(', 'A', 'W', ')',                        '=', 'A', 'O', '5' | 0x80,
  ' ', ':', '(', 'A', 'N', 'Y', ')',            '=', 'E', 'H', '4', 'N', 'I', 'Y' | 0x80,
  '(', 'A', ')', '^', '+', '#',                '=', 'E', 'Y', '5' | 0x80,
  '#', ':', '(', 'A', 'L', 'L', 'Y', ')',        '=', 'U', 'L', 'I', 'Y' | 0x80,
  ' ', '(', 'A', 'L', ')', '#',                '=', 'U', 'L' | 0x80,
  '(', 'A', 'G', 'A', 'I', 'N', ')',            '=', 'A', 'X', 'G', 'E', 'H', '4', 'N' | 0x80,
  '#', ':', '(', 'A', 'G', ')', 'E',            '=', 'I', 'H', 'J' | 0x80,
  '(', 'A', ')', '^', '%',                    '=', 'E', 'Y' | 0x80,
  '(', 'A', ')', '^', '+', ':', '#',            '=', 'A', 'E' | 0x80,
  ' ', ':', '(', 'A', ')', '^', '+', ' ',        '=', 'E', 'Y', '4' | 0x80,
  ' ', '(', 'A', 'R', 'R', ')',                '=', 'A', 'X', 'R' | 0x80,
  '(', 'A', 'R', 'R', ')',                    '=', 'A', 'E', '4', 'R' | 0x80,
  ' ', '^', '(', 'A', 'R', ')', ' ',            '=', 'A', 'A', '5', 'R' | 0x80,
  '(', 'A', 'R', ')',                        '=', 'A', 'A', '5', 'R' | 0x80,
  '(', 'A', 'I', 'R', ')',                    '=', 'E', 'H', '4', 'R' | 0x80,
  '(', 'A', 'I', ')',                        '=', 'E', 'Y', '4' | 0x80,
  '(', 'A', 'Y', ')',                        '=', 'E', 'Y', '5' | 0x80,
  '(', 'A', 'U', ')',                        '=', 'A', 'O', '4' | 0x80,
  '#', ':', '(', 'A', 'L', ')', ' ',            '=', 'U', 'L' | 0x80,
  '#', ':', '(', 'A', 'L', 'S', ')', ' ',        '=', 'U', 'L', 'Z' | 0x80,
  '(', 'A', 'L', 'K', ')',                    '=', 'A', 'O', '4', 'K' | 0x80,
  '(', 'A', 'L', ')', '^',                    '=', 'A', 'O', 'L' | 0x80,
  ' ', ':', '(', 'A', 'B', 'L', 'E', ')',        '=', 'E', 'Y', '4', 'B', 'U', 'L' | 0x80,
  '(', 'A', 'B', 'L', 'E', ')',                '=', 'A', 'X', 'B', 'U', 'L' | 0x80,
  '(', 'A', ')', 'V', 'O',                    '=', 'E', 'Y', '4' | 0x80,
  '(', 'A', 'N', 'G', ')', '+',                '=', 'E', 'Y', '4', 'N', 'J' | 0x80,
  '(', 'A', 'T', 'A', 'R', 'I', ')',            '=', 'A', 'H', 'T', 'A', 'A', '4', 'R', 'I', 'Y' | 0x80,
  '(', 'A', ')', 'T', 'O', 'M',                '=', 'A', 'E' | 0x80,
  '(', 'A', ')', 'T', 'T', 'I',                '=', 'A', 'E' | 0x80,
  ' ', '(', 'A', 'T', ')', ' ',                '=', 'A', 'E', 'T' | 0x80,
  ' ', '(', 'A', ')', 'T',                    '=', 'A', 'H' | 0x80,
  '(', 'A', ')',                            '=', 'A', 'E' | 0x80,

  ']', 'B' | 0x80,
  ' ', '(', 'B', ')', ' ',                    '=', 'B', 'I', 'Y', '4' | 0x80,
  ' ', '(', 'B', 'E', ')', '^', '#',            '=', 'B', 'I', 'H' | 0x80,
  '(', 'B', 'E', 'I', 'N', 'G', ')',            '=', 'B', 'I', 'Y', '4', 'I', 'H', 'N', 'X' | 0x80,
  ' ', '(', 'B', 'O', 'T', 'H', ')', ' ',        '=', 'B', 'O', 'W', '4', 'T', 'H' | 0x80,
  ' ', '(', 'B', 'U', 'S', ')', '#',            '=', 'B', 'I', 'H', '4', 'Z' | 0x80,
  '(', 'B', 'R', 'E', 'A', 'K', ')',            '=', 'B', 'R', 'E', 'Y', '5', 'K' | 0x80,
  '(', 'B', 'U', 'I', 'L', ')',                '=', 'B', 'I', 'H', '4', 'L' | 0x80,
  '(', 'B', ')',                            '=', 'B' | 0x80,

  ']', 'C' | 0x80,
  ' ', '(', 'C', ')', ' ',                    '=', 'S', 'I', 'Y', '4' | 0x80,
  ' ', '(', 'C', 'H', ')', '^',                '=', 'K' | 0x80,
  '^', 'E', '(', 'C', 'H', ')',                '=', 'K' | 0x80,
  '(', 'C', 'H', 'A', ')', 'R', '#',            '=', 'K', 'E', 'H', '5' | 0x80,
  '(', 'C', 'H', ')',                        '=', 'C', 'H' | 0x80,
  ' ', 'S', '(', 'C', 'I', ')', '#',            '=', 'S', 'A', 'Y', '4' | 0x80,
  '(', 'C', 'I', ')', 'A',                    '=', 'S', 'H' | 0x80,
  '(', 'C', 'I', ')', 'O',                    '=', 'S', 'H' | 0x80,
  '(', 'C', 'I', ')', 'E', 'N',                '=', 'S', 'H' | 0x80,
  '(', 'C', 'I', 'T', 'Y', ')',                '=', 'S', 'I', 'H', 'T', 'I', 'Y' | 0x80,
  '(', 'C', ')', '+',                        '=', 'S' | 0x80,
  '(', 'C', 'K', ')',                        '=', 'K' | 0x80,
  '(', 'C', 'O', 'M', 'M', 'O', 'D', 'O', 'R', 'E', ')', '=', 'K', 'A', 'A', '4', 'M', 'A', 'H', 'D', 'O', 'H', 'R' | 0x80,
  '(', 'C', 'O', 'M', ')',                    '=', 'K', 'A', 'H', 'M' | 0x80,
  '(', 'C', 'U', 'I', 'T', ')',                '=', 'K', 'I', 'H', 'T' | 0x80,
  '(', 'C', 'R', 'E', 'A', ')',                '=', 'K', 'R', 'I', 'Y', 'E', 'Y' | 0x80,
  '(', 'C', ')',                            '=', 'K' | 0x80,

  ']', 'D' | 0x80,
  ' ', '(', 'D', ')', ' ',                    '=', 'D', 'I', 'Y', '4' | 0x80,
  ' ', '(', 'D', 'R', '.', ')', ' ',            '=', 'D', 'A', 'A', '4', 'K', 'T', 'E', 'R' | 0x80,
  '#', ':', '(', 'D', 'E', 'D', ')', ' ',        '=', 'D', 'I', 'H', 'D' | 0x80,
  '.', 'E', '(', 'D', ')', ' ',                '=', 'D' | 0x80,
  '#', ':', '^', 'E', '(', 'D', ')', ' ',        '=', 'T' | 0x80,
  ' ', '(', 'D', 'E', ')', '^', '#',            '=', 'D', 'I', 'H' | 0x80,
  ' ', '(', 'D', 'O', ')', ' ',                '=', 'D', 'U', 'W' | 0x80,
  ' ', '(', 'D', 'O', 'E', 'S', ')',            '=', 'D', 'A', 'H', 'Z' | 0x80,
  '(', 'D', 'O', 'N', 'E', ')', ' ',            '=', 'D', 'A', 'H', '5', 'N' | 0x80,
  '(', 'D', 'O', 'I', 'N', 'G', ')',            '=', 'D', 'U', 'W', '4', 'I', 'H', 'N', 'X' | 0x80,
  ' ', '(', 'D', 'O', 'W', ')',                '=', 'D', 'A', 'W' | 0x80,
  '#', '(', 'D', 'U', ')', 'A',                '=', 'J', 'U', 'W' | 0x80,
  '#', '(', 'D', 'U', ')', '^', '#',            '=', 'J', 'A', 'X' | 0x80,
  '(', 'D', ')',                            '=', 'D' | 0x80,

  ']', 'E' | 0x80,
  ' ', '(', 'E', ')', ' ',                    '=', 'I', 'Y', 'I', 'Y', '4' | 0x80,
  '#', ':', '(', 'E', ')', ' ', '=' | 0x80,
  '\'', ':', '^', '(', 'E', ')', ' ', '=' | 0x80,
  ' ', ':', '(', 'E', ')', ' ',                '=', 'I', 'Y' | 0x80,
  '#', '(', 'E', 'D', ')', ' ',                '=', 'D' | 0x80,
  '#', ':', '(', 'E', ')', 'D', ' ', '=' | 0x80,
  '(', 'E', 'V', ')', 'E', 'R',                '=', 'E', 'H', '4', 'V' | 0x80,
  '(', 'E', ')', '^', '%',                    '=', 'I', 'Y', '4' | 0x80,
  '(', 'E', 'R', 'I', ')', '#',                '=', 'I', 'Y', '4', 'R', 'I', 'Y' | 0x80,
  '(', 'E', 'R', 'I', ')',                    '=', 'E', 'H', '4', 'R', 'I', 'H' | 0x80,
  '#', ':', '(', 'E', 'R', ')', '#',            '=', 'E', 'R' | 0x80,
  '(', 'E', 'R', 'R', 'O', 'R', ')',            '=', 'E', 'H', '4', 'R', 'O', 'H', 'R' | 0x80,
  '(', 'E', 'R', 'A', 'S', 'E', ')',            '=', 'I', 'H', 'R', 'E', 'Y', '5', 'S' | 0x80,
  '(', 'E', 'R', ')', '#',                    '=', 'E', 'H', 'R' | 0x80,
  '(', 'E', 'R', ')',                        '=', 'E', 'R' | 0x80,
  ' ', '(', 'E', 'V', 'E', 'N', ')',            '=', 'I', 'Y', 'V', 'E', 'H', 'N' | 0x80,
  '#', ':', '(', 'E', ')', 'W', '=' | 0x80,
  '@', '(', 'E', 'W', ')',                    '=', 'U', 'W' | 0x80,
  '(', 'E', 'W', ')',                        '=', 'Y', 'U', 'W' | 0x80,
  '(', 'E', ')', 'O',                        '=', 'I', 'Y' | 0x80,
  '#', ':', '&', '(', 'E', 'S', ')', ' ',        '=', 'I', 'H', 'Z' | 0x80,
  '#', ':', '(', 'E', ')', 'S', ' ', '=' | 0x80,
  '#', ':', '(', 'E', 'L', 'Y', ')', ' ',        '=', 'L', 'I', 'Y' | 0x80,
  '#', ':', '(', 'E', 'M', 'E', 'N', 'T', ')',    '=', 'M', 'E', 'H', 'N', 'T' | 0x80,
  '(', 'E', 'F', 'U', 'L', ')',                '=', 'F', 'U', 'H', 'L' | 0x80,
  '(', 'E', 'E', ')',                        '=', 'I', 'Y', '4' | 0x80,
  '(', 'E', 'A', 'R', 'N', ')',                '=', 'E', 'R', '5', 'N' | 0x80,
  ' ', '(', 'E', 'A', 'R', ')', '^',            '=', 'E', 'R', '5' | 0x80,
  '(', 'E', 'A', 'D', ')',                    '=', 'E', 'H', 'D' | 0x80,
  '#', ':', '(', 'E', 'A', ')', ' ',            '=', 'I', 'Y', 'A', 'X' | 0x80,
  '(', 'E', 'A', ')', 'S', 'U',                '=', 'E', 'H', '5' | 0x80,
  '(', 'E', 'A', ')',                        '=', 'I', 'Y', '5' | 0x80,
  '(', 'E', 'I', 'G', 'H', ')',                '=', 'E', 'Y', '4' | 0x80,
  '(', 'E', 'I', ')',                        '=', 'I', 'Y', '4' | 0x80,
  ' ', '(', 'E', 'Y', 'E', ')',                '=', 'A', 'Y', '4' | 0x80,
  '(', 'E', 'Y', ')',                        '=', 'I', 'Y' | 0x80,
  '(', 'E', 'U', ')',                        '=', 'Y', 'U', 'W', '5' | 0x80,
  '(', 'E', 'Q', 'U', 'A', 'L', ')',            '=', 'I', 'Y', '4', 'K', 'W', 'U', 'L' | 0x80,
  '(', 'E', ')',                            '=', 'E', 'H' | 0x80,

  ']', 'F' | 0x80,
  ' ', '(', 'F', ')', ' ',                    '=', 'E', 'H', '4', 'F' | 0x80,
  '(', 'F', 'U', 'L', ')',                    '=', 'F', 'U', 'H', 'L' | 0x80,
  '(', 'F', 'R', 'I', 'E', 'N', 'D', ')',        '=', 'F', 'R', 'E', 'H', '5', 'N', 'D' | 0x80,
  '(', 'F', 'A', 'T', 'H', 'E', 'R', ')',        '=', 'F', 'A', 'A', '4', 'D', 'H', 'E', 'R' | 0x80,
  '(', 'F', ')', 'F', '=' | 0x80,
  '(', 'F', ')',                            '=', 'F' | 0x80,

