dretay/stm32f103cb_alarm_clock/Core/Src/STM32SAM.c
  ']', 'O' | 0x80,
  ' ', '(', 'O', ')', ' ',                    '=', 'O', 'H', '4', 'W' | 0x80,
  '(', 'O', 'F', ')', ' ',                    '=', 'A', 'H', 'V' | 0x80,
  ' ', '(', 'O', 'H', ')', ' ',                '=', 'O', 'W', '5' | 0x80,
  '(', 'O', 'R', 'O', 'U', 'G', 'H', ')',        '=', 'E', 'R', '4', 'O', 'W' | 0x80,
  '#', ':', '(', 'O', 'R', ')', ' ',            '=', 'E', 'R' | 0x80,
  '#', ':', '(', 'O', 'R', 'S', ')', ' ',        '=', 'E', 'R', 'Z' | 0x80,
  '(', 'O', 'R', ')',                        '=', 'A', 'O', 'R' | 0x80,
  ' ', '(', 'O', 'N', 'E', ')',                '=', 'W', 'A', 'H', 'N' | 0x80,
  '#', '(', 'O', 'N', 'E', ')', ' ',            '=', 'W', 'A', 'H', 'N' | 0x80,
  '(', 'O', 'W', ')',                        '=', 'O', 'W' | 0x80,
  ' ', '(', 'O', 'V', 'E', 'R', ')',            '=', 'O', 'W', '5', 'V', 'E', 'R' | 0x80,
  'P', 'R', '(', 'O', ')', 'V',                '=', 'U', 'W', '4' | 0x80,
  '(', 'O', 'V', ')',                        '=', 'A', 'H', '4', 'V' | 0x80,
  '(', 'O', ')', '^', '%',                    '=', 'O', 'W', '5' | 0x80,
  '(', 'O', ')', '^', 'E', 'N',                '=', 'O', 'W' | 0x80,
  '(', 'O', ')', '^', 'I', '#',                '=', 'O', 'W', '5' | 0x80,
  '(', 'O', 'L', ')', 'D',                    '=', 'O', 'W', '4', 'L' | 0x80,
  '(', 'O', 'U', 'G', 'H', 'T', ')',            '=', 'A', 'O', '5', 'T' | 0x80,
  '(', 'O', 'U', 'G', 'H', ')',                '=', 'A', 'H', '5', 'F' | 0x80,
  ' ', '(', 'O', 'U', ')',                    '=', 'A', 'W' | 0x80,
  'H', '(', 'O', 'U', ')', 'S', '#',            '=', 'A', 'W', '4' | 0x80,
  '(', 'O', 'U', 'S', ')',                    '=', 'A', 'X', 'S' | 0x80,
  '(', 'O', 'U', 'R', ')',                    '=', 'O', 'H', 'R' | 0x80,
  '(', 'O', 'U', 'L', 'D', ')',                '=', 'U', 'H', '5', 'D' | 0x80,
  '(', 'O', 'U', ')', '^', 'L',                '=', 'A', 'H', '5' | 0x80,
  '(', 'O', 'U', 'P', ')',                    '=', 'U', 'W', '5', 'P' | 0x80,
  '(', 'O', 'U', ')',                        '=', 'A', 'W' | 0x80,
  '(', 'O', 'Y', ')',                        '=', 'O', 'Y' | 0x80,
  '(', 'O', 'I', 'N', 'G', ')',                '=', 'O', 'W', '4', 'I', 'H', 'N', 'X' | 0x80,
  '(', 'O', 'I', ')',                        '=', 'O', 'Y', '5' | 0x80,
  '(', 'O', 'O', 'R', ')',                    '=', 'O', 'H', '5', 'R' | 0x80,
  '(', 'O', 'O', 'K', ')',                    '=', 'U', 'H', '5', 'K' | 0x80,
  'F', '(', 'O', 'O', 'D', ')',                '=', 'U', 'W', '5', 'D' | 0x80,
  'L', '(', 'O', 'O', 'D', ')',                '=', 'A', 'H', '5', 'D' | 0x80,
  'M', '(', 'O', 'O', 'D', ')',                '=', 'U', 'W', '5', 'D' | 0x80,
  '(', 'O', 'O', 'D', ')',                    '=', 'U', 'H', '5', 'D' | 0x80,
  'F', '(', 'O', 'O', 'T', ')',                '=', 'U', 'H', '5', 'T' | 0x80,
  '(', 'O', 'O', ')',                        '=', 'U', 'W', '5' | 0x80,
  '(', 'O', '\'', ')',                        '=', 'O', 'H' | 0x80,
  '(', 'O', ')', 'E',                        '=', 'O', 'W' | 0x80,
  '(', 'O', ')', ' ',                        '=', 'O', 'W' | 0x80,
  '(', 'O', 'A', ')',                        '=', 'O', 'W', '4' | 0x80,
  ' ', '(', 'O', 'N', 'L', 'Y', ')',            '=', 'O', 'W', '4', 'N', 'L', 'I', 'Y' | 0x80,
  ' ', '(', 'O', 'N', 'C', 'E', ')',            '=', 'W', 'A', 'H', '4', 'N', 'S' | 0x80,
  '(', 'O', 'N', '\'', 'T', ')',                '=', 'O', 'W', '4', 'N', 'T' | 0x80,
  'C', '(', 'O', ')', 'N',                    '=', 'A', 'A' | 0x80,
  '(', 'O', ')', 'N', 'G',                    '=', 'A', 'O' | 0x80,
  ' ', ':', '^', '(', 'O', ')', 'N',            '=', 'A', 'H' | 0x80,
  'I', '(', 'O', 'N', ')',                    '=', 'U', 'N' | 0x80,
  '#', ':', '(', 'O', 'N', ')',                '=', 'U', 'N' | 0x80,
  '#', '^', '(', 'O', 'N', ')',                '=', 'U', 'N' | 0x80,
  '(', 'O', ')', 'S', 'T',                    '=', 'O', 'W' | 0x80,
  '(', 'O', 'F', ')', '^',                    '=', 'A', 'O', '4', 'F' | 0x80,
  '(', 'O', 'T', 'H', 'E', 'R', ')',            '=', 'A', 'H', '5', 'D', 'H', 'E', 'R' | 0x80,
  'R', '(', 'O', ')', 'B',                    '=', 'R', 'A', 'A' | 0x80,
  '^', 'R', '(', 'O', ')', ':', '#',            '=', 'O', 'W', '5' | 0x80,
  '(', 'O', 'S', 'S', ')', ' ',                '=', 'A', 'O', '5', 'S' | 0x80,
  '#', ':', '^', '(', 'O', 'M', ')',            '=', 'A', 'H', 'M' | 0x80,
  '(', 'O', ')',                            '=', 'A', 'A' | 0x80,

  ']', 'P' | 0x80,
  ' ', '(', 'P', ')', ' ',                    '=', 'P', 'I', 'Y', '4' | 0x80,
  '(', 'P', 'H', ')',                        '=', 'F' | 0x80,
  '(', 'P', 'E', 'O', 'P', 'L', ')',            '=', 'P', 'I', 'Y', '5', 'P', 'U', 'L' | 0x80,
  '(', 'P', 'O', 'W', ')',                    '=', 'P', 'A', 'W', '4' | 0x80,
  '(', 'P', 'U', 'T', ')', ' ',                '=', 'P', 'U', 'H', 'T' | 0x80,
  '(', 'P', ')', 'P', '=' | 0x80,
  '(', 'P', ')', 'S', '=' | 0x80,
  '(', 'P', ')', 'N', '=' | 0x80,
  '(', 'P', 'R', 'O', 'F', '.', ')',            '=', 'P', 'R', 'O', 'H', 'F', 'E', 'H', '4', 'S', 'E', 'R' | 0x80,
  '(', 'P', ')',                            '=', 'P' | 0x80,

  ']', 'Q' | 0x80,
  ' ', '(', 'Q', ')', ' ',                    '=', 'K', 'Y', 'U', 'W', '4' | 0x80,
  '(', 'Q', 'U', 'A', 'R', ')',                '=', 'K', 'W', 'O', 'H', '5', 'R' | 0x80,
  '(', 'Q', 'U', ')',                        '=', 'K', 'W' | 0x80,
  '(', 'Q', ')',                            '=', 'K' | 0x80,
  ']', 'R' | 0x80,
  ' ', '(', 'R', ')', ' ',                    '=', 'A', 'A', '5', 'R' | 0x80,
  ' ', '(', 'R', 'E', ')', '^', '#',            '=', 'R', 'I', 'Y' | 0x80,
  '(', 'R', ')', 'R', '=' | 0x80,
  '(', 'R', ')',                            '=', 'R' | 0x80,

  ']', 'S' | 0x80,
  ' ', '(', 'S', ')', ' ',                    '=', 'E', 'H', '4', 'S' | 0x80,
  '(', 'S', 'H', ')',                        '=', 'S', 'H' | 0x80,
  '#', '(', 'S', 'I', 'O', 'N', ')',            '=', 'Z', 'H', 'U', 'N' | 0x80,
  '(', 'S', 'O', 'M', 'E', ')',                '=', 'S', 'A', 'H', 'M' | 0x80,
  '#', '(', 'S', 'U', 'R', ')', '#',            '=', 'Z', 'H', 'E', 'R' | 0x80,
  '(', 'S', 'U', 'R', ')', '#',                '=', 'S', 'H', 'E', 'R' | 0x80,
  '#', '(', 'S', 'U', ')', '#',                '=', 'Z', 'H', 'U', 'W' | 0x80,
  '#', '(', 'S', 'S', 'U', ')', '#',            '=', 'S', 'H', 'U', 'W' | 0x80,
  '#', '(', 'S', 'E', 'D', ')',                '=', 'Z', 'D' | 0x80,
  '#', '(', 'S', ')', '#',                    '=', 'Z' | 0x80,
  '(', 'S', 'A', 'I', 'D', ')',                '=', 'S', 'E', 'H', 'D' | 0x80,
  '^', '(', 'S', 'I', 'O', 'N', ')',            '=', 'S', 'H', 'U', 'N' | 0x80,
  '(', 'S', ')', 'S', '=' | 0x80,
  '.', '(', 'S', ')', ' ',                    '=', 'Z' | 0x80,
  '#', ':', '.', 'E', '(', 'S', ')', ' ',        '=', 'Z' | 0x80,
  '#', ':', '^', '#', '(', 'S', ')', ' ',        '=', 'S' | 0x80,
  'U', '(', 'S', ')', ' ',                    '=', 'S' | 0x80,
  ' ', ':', '#', '(', 'S', ')', ' ',            '=', 'Z' | 0x80,
  '#', '#', '(', 'S', ')', ' ',                '=', 'Z' | 0x80,
  ' ', '(', 'S', 'C', 'H', ')',                '=', 'S', 'K' | 0x80,
  '(', 'S', ')', 'C', '+', '=' | 0x80,
  '#', '(', 'S', 'M', ')',                    '=', 'Z', 'U', 'M' | 0x80,
  '#', '(', 'S', 'N', ')', '\'',                '=', 'Z', 'U', 'M' | 0x80,
  '(', 'S', 'T', 'L', 'E', ')',                '=', 'S', 'U', 'L' | 0x80,
  '(', 'S', ')',                            '=', 'S' | 0x80,

  ']', 'T' | 0x80,
  ' ', '(', 'T', ')', ' ',                    '=', 'T', 'I', 'Y', '4' | 0x80,
  ' ', '(', 'T', 'H', 'E', ')', ' ', '#',        '=', 'D', 'H', 'I', 'Y' | 0x80,
  ' ', '(', 'T', 'H', 'E', ')', ' ',            '=', 'D', 'H', 'A', 'X' | 0x80,
  '(', 'T', 'O', ')', ' ',                    '=', 'T', 'U', 'X' | 0x80,
  ' ', '(', 'T', 'H', 'A', 'T', ')',            '=', 'D', 'H', 'A', 'E', 'T' | 0x80,
  ' ', '(', 'T', 'H', 'I', 'S', ')', ' ',        '=', 'D', 'H', 'I', 'H', 'S' | 0x80,
  ' ', '(', 'T', 'H', 'E', 'Y', ')',            '=', 'D', 'H', 'E', 'Y' | 0x80,
  ' ', '(', 'T', 'H', 'E', 'R', 'E', ')',        '=', 'D', 'H', 'E', 'H', 'R' | 0x80,
  '(', 'T', 'H', 'E', 'R', ')',                '=', 'D', 'H', 'E', 'R' | 0x80,
  '(', 'T', 'H', 'E', 'I', 'R', ')',            '=', 'D', 'H', 'E', 'H', 'R' | 0x80,
  ' ', '(', 'T', 'H', 'A', 'N', ')', ' ',        '=', 'D', 'H', 'A', 'E', 'N' | 0x80,
  ' ', '(', 'T', 'H', 'E', 'M', ')', ' ',        '=', 'D', 'H', 'A', 'E', 'N' | 0x80,
  '(', 'T', 'H', 'E', 'S', 'E', ')', ' ',        '=', 'D', 'H', 'I', 'Y', 'Z' | 0x80,
  ' ', '(', 'T', 'H', 'E', 'N', ')',            '=', 'D', 'H', 'E', 'H', 'N' | 0x80,
  '(', 'T', 'H', 'R', 'O', 'U', 'G', 'H', ')',    '=', 'T', 'H', 'R', 'U', 'W', '4' | 0x80,
  '(', 'T', 'H', 'O', 'S', 'E', ')',            '=', 'D', 'H', 'O', 'H', 'Z' | 0x80,
  '(', 'T', 'H', 'O', 'U', 'G', 'H', ')', ' ',    '=', 'D', 'H', 'O', 'W' | 0x80,
  '(', 'T', 'O', 'D', 'A', 'Y', ')',            '=', 'T', 'U', 'X', 'D', 'E', 'Y' | 0x80,
  '(', 'T', 'O', 'M', 'O', ')', 'R', 'R', 'O', 'W', '=', 'T', 'U', 'M', 'A', 'A', '5' | 0x80,
  '(', 'T', 'O', ')', 'T', 'A', 'L',            '=', 'T', 'O', 'W', '5' | 0x80,
  ' ', '(', 'T', 'H', 'U', 'S', ')',            '=', 'D', 'H', 'A', 'H', '4', 'S' | 0x80,
  '(', 'T', 'H', ')',                        '=', 'T', 'H' | 0x80,
  '#', ':', '(', 'T', 'E', 'D', ')',            '=', 'T', 'I', 'X', 'D' | 0x80,
  'S', '(', 'T', 'I', ')', '#', 'N',            '=', 'C', 'H' | 0x80,
  '(', 'T', 'I', ')', 'O',                    '=', 'S', 'H' | 0x80,
  '(', 'T', 'I', ')', 'A',                    '=', 'S', 'H' | 0x80,
  '(', 'T', 'I', 'E', 'N', ')',                '=', 'S', 'H', 'U', 'N' | 0x80,
  '(', 'T', 'U', 'R', ')', '#',                '=', 'C', 'H', 'E', 'R' | 0x80,
  '(', 'T', 'U', ')', 'A',                    '=', 'C', 'H', 'U', 'W' | 0x80,
  ' ', '(', 'T', 'W', 'O', ')',                '=', 'T', 'U', 'W' | 0x80,
  '&', '(', 'T', ')', 'E', 'N', ' ', '=' | 0x80,
  '(', 'T', ')',                            '=', 'T' | 0x80,

  ']', 'U' | 0x80,
  ' ', '(', 'U', ')', ' ',                    '=', 'Y', 'U', 'W', '4' | 0x80,
  ' ', '(', 'U', 'N', ')', 'I',                '=', 'Y', 'U', 'W', 'N' | 0x80,
  ' ', '(', 'U', 'N', ')',                    '=', 'A', 'H', 'N' | 0x80,
  ' ', '(', 'U', 'P', 'O', 'N', ')',            '=', 'A', 'X', 'P', 'A', 'O', 'N' | 0x80,
  '@', '(', 'U', 'R', ')', '#',                '=', 'U', 'H', '4', 'R' | 0x80,
  '(', 'U', 'R', ')', '#',                    '=', 'Y', 'U', 'H', '4', 'R' | 0x80,
  '(', 'U', 'R', ')',                        '=', 'E', 'R' | 0x80,
  '(', 'U', ')', '^', ' ',                    '=', 'A', 'H' | 0x80,
  '(', 'U', ')', '^', '^',                    '=', 'A', 'H', '5' | 0x80,
  '(', 'U', 'Y', ')',                        '=', 'A', 'Y', '5' | 0x80,
  ' ', 'G', '(', 'U', ')', '#', '=' | 0x80,
  'G', '(', 'U', ')', '%', '=' | 0x80,
  'G', '(', 'U', ')', '#',                    '=', 'W' | 0x80,
  '#', 'N', '(', 'U', ')',                    '=', 'Y', 'U', 'W' | 0x80,
  '@', '(', 'U', ')',                        '=', 'U', 'W' | 0x80,
  '(', 'U', ')',                            '=', 'Y', 'U', 'W' | 0x80,

  ']', 'V' | 0x80,
  ' ', '(', 'V', ')', ' ',                    '=', 'V', 'I', 'Y', '4' | 0x80,
  '(', 'V', 'I', 'E', 'W', ')',                '=', 'V', 'Y', 'U', 'W', '5' | 0x80,
  '(', 'V', ')',                            '=', 'V' | 0x80,

