dretay/stm32f103cb_alarm_clock/Core/Src/STM32SAM.c
//26 items. From 'A' to 'Z'
// positions for mem62 and mem63 for each character
static const unsigned char tab37489[] =
{
  0, 149, 247, 162, 57, 197, 6, 126,
  199, 38, 55, 78, 145, 241, 85, 161,
  254, 36, 69, 45, 167, 54, 83, 46,
  71, 218
};

static const unsigned char tab37515[] =
{
  125, 126, 126, 127, 128, 129, 130, 130,
  130, 132, 132, 132, 132, 132, 133, 135,
  135, 136, 136, 137, 138, 139, 139, 140,
  140, 140
};






static void Output8BitAry(int index, unsigned char ary[5]){
  int k;

  uint32_t bufferposOld = bufferpos;

  bufferpos += timetable[oldtimetableindex][index];
  oldtimetableindex = index;


  int sample_uS = bufferpos - bufferposOld ;



  uint32_t f = 0;

  // write a little bit in advance
  for (k = 0; k < 5; k++) {
    //   buffer[bufferpos / 50 + k] = ary[k];


    f = micros() + sample_uS / (_STM32SAM_SPEED + 1);
    while (micros() < f  ) {};


    SetAUDIO(ary[k]);
    //  delayMicroseconds(sample_uS / 5 );
  }

  //  SetAUDIO(ary[0]);



}


static void Output8Bit(int index, unsigned char A){

  unsigned char ary[5] = {A, A, A, A, A};
  Output8BitAry(index, ary);
}


//written by me because of different table positions.
// mem[47] = ...
// 168=pitches
// 169=frequency1
// 170=frequency2
// 171=frequency3
// 172=amplitude1
// 173=amplitude2
// 174=amplitude3
static unsigned char Read(unsigned char p, unsigned char Y){
  switch (p)
  {
    case 168: return pitches[Y];
    case 169: return frequency1[Y];
    case 170: return frequency2[Y];
    case 171: return frequency3[Y];
    case 172: return amplitude1[Y];
    case 173: return amplitude2[Y];
    case 174: return amplitude3[Y];
  }
  // Serial1.println("Error reading to tables");
  return 0;
}

static void Write(unsigned char p, unsigned char Y, unsigned char value){

  switch (p)
  {
    case 168: pitches[Y] = value; return;
    case 169: frequency1[Y] = value;  return;
    case 170: frequency2[Y] = value;  return;
    case 171: frequency3[Y] = value;  return;
    case 172: amplitude1[Y] = value;  return;
    case 173: amplitude2[Y] = value;  return;
    case 174: amplitude3[Y] = value;  return;
  }
  //Serial1.println("Error writing to tables\n");
}




// -------------------------------------------------------------------------
//Code48227
// Render a sampled sound from the sampleTable.
//
//   Phoneme   Sample Start   Sample End
//   32: S*    15             255
//   33: SH    257            511
//   34: F*    559            767
//   35: TH    583            767
//   36: /H    903            1023
//   37: /X    1135           1279
//   38: Z*    84             119
//   39: ZH    340            375
//   40: V*    596            639
//   41: DH    596            631
//
//   42: CH
//   43: **    399            511
//
//   44: J*
//   45: **    257            276
//   46: **
//
//   66: P*
//   67: **    743            767
//   68: **
//
//   69: T*
//   70: **    231            255
//   71: **
//
// The SampledPhonemesTable[] holds flags indicating if a phoneme is
// voiced or not. If the upper 5 bits are zero, the sample is voiced.
//
// Samples in the sampleTable are compressed, with bits being converted to
// bytes from high bit to low, as follows:
//
//   unvoiced 0 bit   -> X
//   unvoiced 1 bit   -> 5
//
//   voiced 0 bit     -> 6
//   voiced 1 bit     -> 24
//
// Where X is a value from the table:
//
//   { 0x18, 0x1A, 0x17, 0x17, 0x17 };
//
// The index into this table is determined by masking off the lower
// 3 bits from the SampledPhonemesTable:
//
//        index = (SampledPhonemesTable[i] & 7) - 1;
//
// For voices samples, samples are interleaved between voiced output.


// Code48227()
static void RenderSample(unsigned char *mem66){
  int tempA;
  // current phoneme's index
  mem49 = Y;

  // mask low three bits and subtract 1 get value to
  // convert 0 bits on unvoiced samples.
  A = mem39 & 7;
  X = A - 1;

  // store the result
  mem56 = X;

  // determine which offset to use from table { 0x18, 0x1A, 0x17, 0x17, 0x17 }
  // T, S, Z                0          0x18
  // CH, J, SH, ZH          1          0x1A
  // P, F*, V, TH, DH       2          0x17
  // /H                     3          0x17
  // /X                     4          0x17

  // get value from the table
  mem53 = tab48426[X];
  mem47 = X;      //46016+mem[56]*256

  // voiced sample?
  A = mem39 & 248;
  if (A == 0)
  {
    // voiced phoneme: Z*, ZH, V*, DH
    Y = mem49;
    A = pitches[mem49] >> 4;

    // jump to voiced portion
    goto pos48315;
  }

  Y = A ^ 255;
pos48274:

  // step through the 8 bits in the sample
  mem56 = 8;

  // get the next sample from the table
  // mem47*256 = offset to start of samples
  A = sampleTable[mem47 * 256 + Y];
pos48280:

  // left shift to get the high bit
  tempA = A;
  A = A << 1;
  //48281: BCC 48290

  // bit not set?
  if ((tempA & 128) == 0)
  {
    // convert the bit to value from table
    X = mem53;
    //mem[54296] = X;
    // output the byte
    Output8Bit(1, (X & 0x0f) * 16);
    // if X != 0, exit loop
    if (X != 0) goto pos48296;
  }

  // output a 5 for the on bit
  Output8Bit(2, 5 * 16);

  //48295: NOP
pos48296:

  X = 0;

  // decrement counter
  mem56--;

  // if not done, jump to top of loop
  if (mem56 != 0) goto pos48280;

  // increment position
  Y++;
  if (Y != 0) goto pos48274;

  // restore values and return
  mem44 = 1;
  Y = mem49;
  return;


  unsigned char phase1;

pos48315:
  // handle voiced samples here

  // number of samples?
  phase1 = A ^ 255;

  Y = *mem66;
  do
  {
    //pos48321:

    // shift through all 8 bits
    mem56 = 8;
    //A = Read(mem47, Y);

    // fetch value from table
    A = sampleTable[mem47 * 256 + Y];

    // loop 8 times
    //pos48327:
    do
    {
      //48327: ASL A
      //48328: BCC 48337

      // left shift and check high bit
      tempA = A;
      A = A << 1;
      if ((tempA & 128) != 0)
      {
        // if bit set, output 26
        X = 26;
        Output8Bit(3, (X & 0xf) * 16);
      } else
      {
        //timetable 4
        // bit is not set, output a 6
        X = 6;
        Output8Bit(4, (X & 0xf) * 16);
      }

      mem56--;
    } while (mem56 != 0);

    // move ahead in the table
    Y++;

