dretay/stm32f103cb_alarm_clock/Core/Src/STM32SAM.c
    // continue until counter done
    phase1++;

  } while (phase1 != 0);
  //  if (phase1 != 0) goto pos48321;

  // restore values and return
  A = 1;
  mem44 = 1;
  *mem66 = Y;
  Y = mem49;
  return;
}





// RENDER THE PHONEMES IN THE LIST
//
// The phoneme list is converted into sound through the steps:
//
// 1. Copy each phoneme <length> number of times into the frames list,
//    where each frame represents 10 milliseconds of sound.
//
// 2. Determine the transitions lengths between phonemes, and linearly
//    interpolate the values across the frames.
//
// 3. Offset the pitches by the fundamental frequency.
//
// 4. Render the each frame.



//void Code47574()
static void Render()
{
  unsigned char phase1 = 0;  //mem43
  unsigned char phase2 = 0;
  unsigned char phase3 = 0;
  unsigned char mem66 = 0;
  unsigned char mem38 = 0;
  unsigned char mem40 = 0;
  unsigned char speedcounter = 0; //mem45
  unsigned char mem48 = 0;
  int i;
  if (phonemeIndexOutput[0] == 255) return; //exit if no data

  A = 0;
  X = 0;
  mem44 = 0;


  // CREATE FRAMES
  //
  // The length parameter in the list corresponds to the number of frames
  // to expand the phoneme to. Each frame represents 10 milliseconds of time.
  // So a phoneme with a length of 7 = 7 frames = 70 milliseconds duration.
  //
  // The parameters are copied from the phoneme to the frame verbatim.


  // pos47587:
  do
  {
    // get the index
    Y = mem44;
    // get the phoneme at the index
    A = phonemeIndexOutput[mem44];
    mem56 = A;

    // if terminal phoneme, exit the loop
    if (A == 255) break;

    // period phoneme *.
    if (A == 1)
    {
      // add rising inflection
      A = 1;
      mem48 = 1;
      //goto pos48376;
      AddInflection(mem48, phase1);
    }
    /*
      if (A == 2) goto pos48372;
    */

    // question mark phoneme?
    if (A == 2)
    {
      // create falling inflection
      mem48 = 255;
      AddInflection(mem48, phase1);
    }
    //  pos47615:

    // get the stress amount (more stress = higher pitch)
    phase1 = tab47492[stressOutput[Y] + 1];

    // get number of frames to write
    phase2 = phonemeLengthOutput[Y];
    Y = mem56;

    // copy from the source to the frames list
    do
    {
      frequency1[X] = freq1data[Y];     // F1 frequency
      frequency2[X] = freq2data[Y];     // F2 frequency
      frequency3[X] = freq3data[Y];     // F3 frequency
      amplitude1[X] = ampl1data[Y];     // F1 amplitude
      amplitude2[X] = ampl2data[Y];     // F2 amplitude
      amplitude3[X] = ampl3data[Y];     // F3 amplitude
      sampledConsonantFlag[X] = sampledConsonantFlags[Y];        // phoneme data for sampled consonants
      pitches[X] = pitch + phase1;      // pitch
      X++;
      phase2--;
    } while (phase2 != 0);
    mem44++;
  } while (mem44 != 0);
  // -------------------
  //pos47694:

  // CREATE TRANSITIONS
  //
  // Linear transitions are now created to smoothly connect the
  // end of one sustained portion of a phoneme to the following
  // phoneme.
  //
  // To do this, three tables are used:
  //
  //  Table         Purpose
  //  =========     ==================================================
  //  blendRank     Determines which phoneme's blend values are used.
  //
  //  blendOut      The number of frames at the end of the phoneme that
  //                will be used to transition to the following phoneme.
  //
  //  blendIn       The number of frames of the following phoneme that
  //                will be used to transition into that phoneme.
  //
  // In creating a transition between two phonemes, the phoneme
  // with the HIGHEST rank is used. Phonemes are ranked on how much
  // their identity is based on their transitions. For example,
  // vowels are and diphthongs are identified by their sustained portion,
  // rather than the transitions, so they are given low values. In contrast,
  // stop consonants (P, B, T, K) and glides (Y, L) are almost entirely
  // defined by their transitions, and are given high rank values.
  //
  // Here are the rankings used by SAM:
  //
  //     Rank    Type                         Phonemes
  //     2       All vowels                   IY, IH, etc.
  //     5       Diphthong endings            YX, WX, ER
  //     8       Terminal liquid consonants   LX, WX, YX, N, NX
  //     9       Liquid consonants            L, RX, W
  //     10      Glide                        R, OH
  //     11      Glide                        WH
  //     18      Voiceless fricatives         S, SH, F, TH
  //     20      Voiced fricatives            Z, ZH, V, DH
  //     23      Plosives, stop consonants    P, T, K, KX, DX, CH
  //     26      Stop consonants              J, GX, B, D, G
  //     27-29   Stop consonants (internal)   **
  //     30      Unvoiced consonants          /H, /X and Q*
  //     160     Nasal                        M
  //
  // To determine how many frames to use, the two phonemes are
  // compared using the blendRank[] table. The phoneme with the
  // higher rank is selected. In case of a tie, a blend of each is used:
  //
  //      if blendRank[phoneme1] ==  blendRank[phomneme2]
  //          // use lengths from each phoneme
  //          outBlendFrames = outBlend[phoneme1]
  //          inBlendFrames = outBlend[phoneme2]
  //      else if blendRank[phoneme1] > blendRank[phoneme2]
  //          // use lengths from first phoneme
  //          outBlendFrames = outBlendLength[phoneme1]
  //          inBlendFrames = inBlendLength[phoneme1]
  //      else
  //          // use lengths from the second phoneme
  //          // note that in and out are SWAPPED!
  //          outBlendFrames = inBlendLength[phoneme2]
  //          inBlendFrames = outBlendLength[phoneme2]
  //
  // Blend lengths can't be less than zero.
  //
  // Transitions are assumed to be symetrical, so if the transition
  // values for the second phoneme are used, the inBlendLength and
  // outBlendLength values are SWAPPED.
  //
  // For most of the parameters, SAM interpolates over the range of the last
  // outBlendFrames-1 and the first inBlendFrames.
  //
  // The exception to this is the Pitch[] parameter, which is interpolates the
  // pitch from the CENTER of the current phoneme to the CENTER of the next
  // phoneme.
  //
  // Here are two examples. First, For example, consider the word "SUN" (S AH N)
  //
  //    Phoneme   Duration    BlendWeight    OutBlendFrames    InBlendFrames
  //    S         2           18             1                 3
  //    AH        8           2              4                 4
  //    N         7           8              1                 2
  //
  // The formant transitions for the output frames are calculated as follows:
  //
  //     flags ampl1 freq1 ampl2 freq2 ampl3 freq3 pitch
  //    ------------------------------------------------
  // S
  //    241     0     6     0    73     0    99    61   Use S (weight 18) for transition instead of AH (weight 2)
  //    241     0     6     0    73     0    99    61   <-- (OutBlendFrames-1) = (1-1) = 0 frames
  // AH
  //      0     2    10     2    66     0    96    59 * <-- InBlendFrames = 3 frames
  //      0     4    14     3    59     0    93    57 *
  //      0     8    18     5    52     0    90    55 *
  //      0    15    22     9    44     1    87    53
  //      0    15    22     9    44     1    87    53
  //      0    15    22     9    44     1    87    53   Use N (weight 8) for transition instead of AH (weight 2).
  //      0    15    22     9    44     1    87    53   Since N is second phoneme, reverse the IN and OUT values.
  //      0    11    17     8    47     1    98    56 * <-- (InBlendFrames-1) = (2-1) = 1 frames
  // N
  //      0     8    12     6    50     1   109    58 * <-- OutBlendFrames = 1
  //      0     5     6     5    54     0   121    61
  //      0     5     6     5    54     0   121    61
  //      0     5     6     5    54     0   121    61
  //      0     5     6     5    54     0   121    61
  //      0     5     6     5    54     0   121    61
  //      0     5     6     5    54     0   121    61
  //
  // Now, consider the reverse "NUS" (N AH S):
  //
  //     flags ampl1 freq1 ampl2 freq2 ampl3 freq3 pitch
  //    ------------------------------------------------
  // N
  //     0     5     6     5    54     0   121    61
  //     0     5     6     5    54     0   121    61
  //     0     5     6     5    54     0   121    61
  //     0     5     6     5    54     0   121    61
  //     0     5     6     5    54     0   121    61
  //     0     5     6     5    54     0   121    61   Use N (weight 8) for transition instead of AH (weight 2)
  //     0     5     6     5    54     0   121    61   <-- (OutBlendFrames-1) = (1-1) = 0 frames
  // AH
  //     0     8    11     6    51     0   110    59 * <-- InBlendFrames = 2
  //     0    11    16     8    48     0    99    56 *
  //     0    15    22     9    44     1    87    53   Use S (weight 18) for transition instead of AH (weight 2)
  //     0    15    22     9    44     1    87    53   Since S is second phoneme, reverse the IN and OUT values.
  //     0     9    18     5    51     1    90    55 * <-- (InBlendFrames-1) = (3-1) = 2
  //     0     4    14     3    58     1    93    57 *
  // S
  //   241     2    10     2    65     1    96    59 * <-- OutBlendFrames = 1
  //   241     0     6     0    73     0    99    61

  A = 0;
  mem44 = 0;
  mem49 = 0; // mem49 starts at as 0
  X = 0;
  while (1) //while No. 1
  {

    // get the current and following phoneme
    Y = phonemeIndexOutput[X];
    A = phonemeIndexOutput[X + 1];
    X++;

    // exit loop at end token
    if (A == 255) break;//goto pos47970;


