dretay/stm32f103cb_alarm_clock/Core/Src/STM32SAM.c
    // get the ranking of each phoneme
    X = A;
    mem56 = blendRank[A];
    A = blendRank[Y];

    // compare the rank - lower rank value is stronger
    if (A == mem56)
    {
      // same rank, so use out blend lengths from each phoneme
      phase1 = outBlendLength[Y];
      phase2 = outBlendLength[X];
    } else if (A < mem56)
    {
      // first phoneme is stronger, so us it's blend lengths
      phase1 = inBlendLength[X];
      phase2 = outBlendLength[X];
    } else
    {
      // second phoneme is stronger, so use it's blend lengths
      // note the out/in are swapped
      phase1 = outBlendLength[Y];
      phase2 = inBlendLength[Y];
    }

    Y = mem44;
    A = mem49 + phonemeLengthOutput[mem44]; // A is mem49 + length
    mem49 = A; // mem49 now holds length + position
    A = A + phase2; //Maybe Problem because of carry flag

    //47776: ADC 42
    speedcounter = A;
    mem47 = 168;
    phase3 = mem49 - phase1; // what is mem49
    A = phase1 + phase2; // total transition?
    mem38 = A;

    X = A;
    X -= 2;
    if ((X & 128) == 0)
      do   //while No. 2
      {
        //pos47810:

        // mem47 is used to index the tables:
        // 168  pitches[]
        // 169  frequency1
        // 170  frequency2
        // 171  frequency3
        // 172  amplitude1
        // 173  amplitude2
        // 174  amplitude3

        mem40 = mem38;

        if (mem47 == 168)     // pitch
        {

          // unlike the other values, the pitches[] interpolates from
          // the middle of the current phoneme to the middle of the
          // next phoneme

          unsigned char mem36, mem37;
          // half the width of the current phoneme
          mem36 = phonemeLengthOutput[mem44] >> 1;
          // half the width of the next phoneme
          mem37 = phonemeLengthOutput[mem44 + 1] >> 1;
          // sum the values
          mem40 = mem36 + mem37; // length of both halves
          mem37 += mem49; // center of next phoneme
          mem36 = mem49 - mem36; // center index of current phoneme
          A = Read(mem47, mem37); // value at center of next phoneme - end interpolation value
          //A = mem[address];

          Y = mem36; // start index of interpolation
          mem53 = A - Read(mem47, mem36); // value to center of current phoneme
        } else
        {
          // value to interpolate to
          A = Read(mem47, speedcounter);
          // position to start interpolation from
          Y = phase3;
          // value to interpolate from
          mem53 = A - Read(mem47, phase3);
        }

        //Code47503(mem40);
        // ML : Code47503 is division with remainder, and mem50 gets the sign

        // calculate change per frame
        signed char m53 = (signed char)mem53;
        mem50 = mem53 & 128;
        unsigned char m53abs = abs(m53);
        mem51 = m53abs % mem40; //abs((char)m53) % mem40;
        mem53 = (unsigned char)((signed char)(m53) / mem40);

        // interpolation range
        X = mem40; // number of frames to interpolate over
        Y = phase3; // starting frame


        // linearly interpolate values

        mem56 = 0;
        //47907: CLC
        //pos47908:
        while (1)    //while No. 3
        {
          A = Read(mem47, Y) + mem53; //carry alway cleared

          mem48 = A;
          Y++;
          X--;
          if (X == 0) break;

          mem56 += mem51;
          if (mem56 >= mem40)  //???
          {
            mem56 -= mem40; //carry? is set
            //if ((mem56 & 128)==0)
            if ((mem50 & 128) == 0)
            {
              //47935: BIT 50
              //47937: BMI 47943
              if (mem48 != 0) mem48++;
            } else mem48--;
          }
          //pos47945:
          Write(mem47, Y, mem48);
        } //while No. 3

        //pos47952:
        mem47++;
        //if (mem47 != 175) goto pos47810;
      } while (mem47 != 175);     //while No. 2
    //pos47963:
    mem44++;
    X = mem44;
  }  //while No. 1

  //goto pos47701;
  //pos47970:

  // add the length of this phoneme
  mem48 = mem49 + phonemeLengthOutput[mem44];


  // ASSIGN PITCH CONTOUR
  //
  // This subtracts the F1 frequency from the pitch to create a
  // pitch contour. Without this, the output would be at a single
  // pitch level (monotone).


  // don't adjust pitch if in sing mode
  if (!singmode)
  {
    // iterate through the buffer
    for (i = 0; i < 256; i++) {
      // subtract half the frequency of the formant 1.
      // this adds variety to the voice
      pitches[i] -= (frequency1[i] >> 1);
    }
  }

  phase1 = 0;
  phase2 = 0;
  phase3 = 0;
  mem49 = 0;
  speedcounter = 72; //sam standard speed

  // RESCALE AMPLITUDE
  //
  // Rescale volume from a linear scale to decibels.
  //

  //amplitude rescaling
  for (i = 255; i >= 0; i--)
  {
    amplitude1[i] = amplitudeRescale[amplitude1[i]];
    amplitude2[i] = amplitudeRescale[amplitude2[i]];
    amplitude3[i] = amplitudeRescale[amplitude3[i]];
  }

  Y = 0;
  A = pitches[0];
  mem44 = A;
  X = A;
  mem38 = A - (A >> 2);   // 3/4*A ???


  // PROCESS THE FRAMES
  //
  // In traditional vocal synthesis, the glottal pulse drives filters, which
  // are attenuated to the frequencies of the formants.
  //
  // SAM generates these formants directly with sin and rectangular waves.
  // To simulate them being driven by the glottal pulse, the waveforms are
  // reset at the beginning of each glottal pulse.

  //finally the loop for sound output
  //pos48078:
  while (1)
  {
    // get the sampled information on the phoneme
    A = sampledConsonantFlag[Y];
    mem39 = A;

    // unvoiced sampled phoneme?
    A = A & 248;
    if (A != 0)
    {
      // render the sample for the phoneme
      RenderSample(&mem66);

      // skip ahead two in the phoneme buffer
      Y += 2;
      mem48 -= 2;
    } else
    {
      // simulate the glottal pulse and formants
      unsigned char ary[5];
      unsigned int p1 = phase1 * 256; // Fixed point integers because we need to divide later on
      unsigned int p2 = phase2 * 256;
      unsigned int p3 = phase3 * 256;
      int k;
      for (k = 0; k < 5; k++) {
        signed char sp1 = (signed char)sinus[0xff & (p1 >> 8)];
        signed char sp2 = (signed char)sinus[0xff & (p2 >> 8)];
        signed char rp3 = (signed char)rectangle[0xff & (p3 >> 8)];
        signed int sin1 = sp1 * ((unsigned char)amplitude1[Y] & 0x0f);
        signed int sin2 = sp2 * ((unsigned char)amplitude2[Y] & 0x0f);
        signed int rect = rp3 * ((unsigned char)amplitude3[Y] & 0x0f);
        signed int mux = sin1 + sin2 + rect;
        mux /= 32;
        mux += 128; // Go from signed to unsigned amplitude
        ary[k] = mux;
        p1 += frequency1[Y] * 256 / 4; // Compromise, this becomes a shift and works well
        p2 += frequency2[Y] * 256 / 4;
        p3 += frequency3[Y] * 256 / 4;
      }
      // output the accumulated value
      Output8BitAry(0, ary);
      speedcounter--;
      if (speedcounter != 0) goto pos48155;
      Y++; //go to next amplitude

      // decrement the frame count
      mem48--;
    }

    // if the frame count is zero, exit the loop
    if (mem48 == 0)  return;
    speedcounter = speed;
pos48155:

    // decrement the remaining length of the glottal pulse
    mem44--;

