dretay/stm32f103cb_alarm_clock/Core/Src/STM32SAM.c
// input[] holds the string of phonemes, each two bytes wide
// signInputTable1[] holds the first character of each phoneme
// signInputTable2[] holds te second character of each phoneme
// phonemeIndex[] holds the indexes of the phonemes after parsing input[]
//
// The parser scans through the input[], finding the names of the phonemes
// by searching signInputTable1[] and signInputTable2[]. On a match, it
// copies the index of the phoneme into the phonemeIndexTable[].
//
// The character <0x9B> marks the end of text in input[]. When it is reached,
// the index 255 is placed at the end of the phonemeIndexTable[], and the
// function returns with a 1 indicating success.
static int Parser1(){
  int i;
  unsigned char sign1;
  unsigned char sign2;
  unsigned char position = 0;
  X = 0;
  A = 0;
  Y = 0;

  // CLEAR THE STRESS TABLE
  for (i = 0; i < 256; i++)
    stress[i] = 0;

  // THIS CODE MATCHES THE PHONEME LETTERS TO THE TABLE
  // pos41078:
  while (1)
  {
    // GET THE FIRST CHARACTER FROM THE PHONEME BUFFER
    sign1 = input[X];
    // TEST FOR 155 (�) END OF LINE MARKER
    if (sign1 == 155)
    {
      // MARK ENDPOINT AND RETURN
      phonemeindex[position] = 255;      //mark endpoint
      // REACHED END OF PHONEMES, SO EXIT
      return 1;       //all ok
    }

    // GET THE NEXT CHARACTER FROM THE BUFFER
    X++;
    sign2 = input[X];

    // NOW sign1 = FIRST CHARACTER OF PHONEME, AND sign2 = SECOND CHARACTER OF PHONEME

    // TRY TO MATCH PHONEMES ON TWO TWO-CHARACTER NAME
    // IGNORE PHONEMES IN TABLE ENDING WITH WILDCARDS

    // SET INDEX TO 0
    Y = 0;
pos41095:

    // GET FIRST CHARACTER AT POSITION Y IN signInputTable
    // --> should change name to PhonemeNameTable1
    A = signInputTable1[Y];

    // FIRST CHARACTER MATCHES?
    if (A == sign1)
    {
      // GET THE CHARACTER FROM THE PhonemeSecondLetterTable
      A = signInputTable2[Y];
      // NOT A SPECIAL AND MATCHES SECOND CHARACTER?
      if ((A != '*') && (A == sign2))
      {
        // STORE THE INDEX OF THE PHONEME INTO THE phomeneIndexTable
        phonemeindex[position] = Y;

        // ADVANCE THE POINTER TO THE phonemeIndexTable
        position++;
        // ADVANCE THE POINTER TO THE phonemeInputBuffer
        X++;

        // CONTINUE PARSING
        continue;
      }
    }

    // NO MATCH, TRY TO MATCH ON FIRST CHARACTER TO WILDCARD NAMES (ENDING WITH '*')

    // ADVANCE TO THE NEXT POSITION
    Y++;
    // IF NOT END OF TABLE, CONTINUE
    if (Y != 81) goto pos41095;

    // REACHED END OF TABLE WITHOUT AN EXACT (2 CHARACTER) MATCH.
    // THIS TIME, SEARCH FOR A 1 CHARACTER MATCH AGAINST THE WILDCARDS

    // RESET THE INDEX TO POINT TO THE START OF THE PHONEME NAME TABLE
    Y = 0;
pos41134:
    // DOES THE PHONEME IN THE TABLE END WITH '*'?
    if (signInputTable2[Y] == '*')
    {
      // DOES THE FIRST CHARACTER MATCH THE FIRST LETTER OF THE PHONEME
      if (signInputTable1[Y] == sign1)
      {
        // SAVE THE POSITION AND MOVE AHEAD
        phonemeindex[position] = Y;

        // ADVANCE THE POINTER
        position++;

        // CONTINUE THROUGH THE LOOP
        continue;
      }
    }
    Y++;
    if (Y != 81) goto pos41134; //81 is size of PHONEME NAME table

    // FAILED TO MATCH WITH A WILDCARD. ASSUME THIS IS A STRESS
    // CHARACTER. SEARCH THROUGH THE STRESS TABLE

    // SET INDEX TO POSITION 8 (END OF STRESS TABLE)
    Y = 8;

    // WALK BACK THROUGH TABLE LOOKING FOR A MATCH
    while ( (sign1 != stressInputTable[Y]) && (Y > 0))
    {
      // DECREMENT INDEX
      Y--;
    }

    // REACHED THE END OF THE SEARCH WITHOUT BREAKING OUT OF LOOP?
    if (Y == 0)
    {
      //mem[39444] = X;
      //41181: JSR 42043 //Error
      // FAILED TO MATCH ANYTHING, RETURN 0 ON FAILURE
      return 0;
    }
    // SET THE STRESS FOR THE PRIOR PHONEME
    stress[position - 1] = Y;
  } //while
}




//change phonemelength depedendent on stress
//void Code41203()
static void SetPhonemeLength(){
  unsigned char A;
  int position = 0;
  while (phonemeindex[position] != 255 )
  {
    A = stress[position];
    //41218: BMI 41229
    if ((A == 0) || ((A & 128) != 0))
    {
      phonemeLength[position] = phonemeLengthTable[phonemeindex[position]];
    } else
    {
      phonemeLength[position] = phonemeStressedLengthTable[phonemeindex[position]];
    }
    position++;
  }
}


static void Code41240()
{
  unsigned char pos = 0;

  while (phonemeindex[pos] != 255)
  {
    unsigned char index; //register AC
    X = pos;
    index = phonemeindex[pos];
    if ((flags[index] & 2) == 0)
    {
      pos++;
      continue;
    } else if ((flags[index] & 1) == 0)
    {
      Insert(pos + 1, index + 1, phonemeLengthTable[index + 1], stress[pos]);
      Insert(pos + 2, index + 2, phonemeLengthTable[index + 2], stress[pos]);
      pos += 3;
      continue;
    }

    do
    {
      X++;
      A = phonemeindex[X];
    } while (A == 0);

    if (A != 255)
    {
      if ((flags[A] & 8) != 0)  {
        pos++;
        continue;
      }
      if ((A == 36) || (A == 37)) {
        pos++;  // '/H' '/X'
        continue;
      }
    }

    Insert(pos + 1, index + 1, phonemeLengthTable[index + 1], stress[pos]);
    Insert(pos + 2, index + 2, phonemeLengthTable[index + 2], stress[pos]);
    pos += 3;
  };

}




// Rewrites the phonemes using the following rules:
//
//       <DIPHTONG ENDING WITH WX> -> <DIPHTONG ENDING WITH WX> WX
//       <DIPHTONG NOT ENDING WITH WX> -> <DIPHTONG NOT ENDING WITH WX> YX
//       UL -> AX L
//       UM -> AX M
//       <STRESSED VOWEL> <SILENCE> <STRESSED VOWEL> -> <STRESSED VOWEL> <SILENCE> Q <VOWEL>
//       T R -> CH R
//       D R -> J R
//       <VOWEL> R -> <VOWEL> RX
//       <VOWEL> L -> <VOWEL> LX
//       G S -> G Z
//       K <VOWEL OR DIPHTONG NOT ENDING WITH IY> -> KX <VOWEL OR DIPHTONG NOT ENDING WITH IY>
//       G <VOWEL OR DIPHTONG NOT ENDING WITH IY> -> GX <VOWEL OR DIPHTONG NOT ENDING WITH IY>
//       S P -> S B
//       S T -> S D
//       S K -> S G
//       S KX -> S GX
//       <ALVEOLAR> UW -> <ALVEOLAR> UX
//       CH -> CH CH' (CH requires two phonemes to represent it)
//       J -> J J' (J requires two phonemes to represent it)
//       <UNSTRESSED VOWEL> T <PAUSE> -> <UNSTRESSED VOWEL> DX <PAUSE>
//       <UNSTRESSED VOWEL> D <PAUSE>  -> <UNSTRESSED VOWEL> DX <PAUSE>


//void Code41397()
static void Parser2()
{

  unsigned char pos = 0; //mem66;
  unsigned char mem58 = 0;


  // Loop through phonemes
  while (1)
  {
    // SET X TO THE CURRENT POSITION
    X = pos;
    // GET THE PHONEME AT THE CURRENT POSITION
    A = phonemeindex[pos];



