dretay/stm32f103cb_alarm_clock/Core/Src/STM32SAM.c
    // Is phoneme pause?
    if (A == 0)
    {
      // Move ahead to the
      pos++;
      continue;
    }

    // If end of phonemes flag reached, exit routine
    if (A == 255) return;

    // Copy the current phoneme index to Y
    Y = A;

    // RULE:
    //       <DIPHTONG ENDING WITH WX> -> <DIPHTONG ENDING WITH WX> WX
    //       <DIPHTONG NOT ENDING WITH WX> -> <DIPHTONG NOT ENDING WITH WX> YX
    // Example: OIL, COW


    // Check for DIPHTONG
    if ((flags[A] & 16) == 0) goto pos41457;

    // Not a diphthong. Get the stress
    mem58 = stress[pos];

    // End in IY sound?
    A = flags[Y] & 32;

    // If ends with IY, use YX, else use WX
    if (A == 0) A = 20; else A = 21;    // 'WX' = 20 'YX' = 21
    //pos41443:
    // Insert at WX or YX following, copying the stress


    Insert(pos + 1, A, mem59, mem58);
    X = pos;
    // Jump to ???
    goto pos41749;



pos41457:

    // RULE:
    //       UL -> AX L
    // Example: MEDDLE

    // Get phoneme
    A = phonemeindex[X];
    // Skip this rule if phoneme is not UL
    if (A != 78) goto pos41487;  // 'UL'
    A = 24;         // 'L'                 //change 'UL' to 'AX L'



pos41466:
    // Get current phoneme stress
    mem58 = stress[X];

    // Change UL to AX
    phonemeindex[X] = 13;  // 'AX'
    // Perform insert. Note code below may jump up here with different values
    Insert(X + 1, A, mem59, mem58);
    pos++;
    // Move to next phoneme
    continue;

pos41487:

    // RULE:
    //       UM -> AX M
    // Example: ASTRONOMY

    // Skip rule if phoneme != UM
    if (A != 79) goto pos41495;   // 'UM'
    // Jump up to branch - replaces current phoneme with AX and continues
    A = 27; // 'M'  //change 'UM' to  'AX M'

    goto pos41466;
pos41495:

    // RULE:
    //       UN -> AX N
    // Example: FUNCTION


    // Skip rule if phoneme != UN
    if (A != 80) goto pos41503; // 'UN'

    // Jump up to branch - replaces current phoneme with AX and continues
    A = 28;         // 'N' //change UN to 'AX N'

    goto pos41466;
pos41503:

    // RULE:
    //       <STRESSED VOWEL> <SILENCE> <STRESSED VOWEL> -> <STRESSED VOWEL> <SILENCE> Q <VOWEL>
    // EXAMPLE: AWAY EIGHT

    Y = A;
    // VOWEL set?
    A = flags[A] & 128;

    // Skip if not a vowel
    if (A != 0)
    {
      // Get the stress
      A = stress[X];

      // If stressed...
      if (A != 0)
      {
        // Get the following phoneme
        X++;
        A = phonemeindex[X];
        // If following phoneme is a pause

        if (A == 0)
        {
          // Get the phoneme following pause
          X++;
          Y = phonemeindex[X];

          // Check for end of buffer flag
          if (Y == 255) //buffer overflow
            // ??? Not sure about these flags
            A = 65 & 128;
          else
            // And VOWEL flag to current phoneme's flags
            A = flags[Y] & 128;

          // If following phonemes is not a pause
          if (A != 0)
          {
            // If the following phoneme is not stressed
            A = stress[X];
            if (A != 0)
            {

              // 31 = 'Q'
              Insert(X, 31, mem59, 0);
              pos++;
              continue;
            }
          }
        }
      }
    }


    // RULES FOR PHONEMES BEFORE R
    //        T R -> CH R
    // Example: TRACK


    // Get current position and phoneme
    X = pos;
    A = phonemeindex[pos];
    if (A != 23) goto pos41611;     // 'R'

    // Look at prior phoneme
    X--;
    A = phonemeindex[pos - 1];
    //pos41567:
    if (A == 69)                    // 'T'
    {

      phonemeindex[pos - 1] = 42;
      goto pos41779;
    }


    // RULES FOR PHONEMES BEFORE R
    //        D R -> J R
    // Example: DRY

    // Prior phonemes D?
    if (A == 57)                    // 'D'
    {
      // Change D to J
      phonemeindex[pos - 1] = 44;

      goto pos41788;
    }

    // RULES FOR PHONEMES BEFORE R
    //        <VOWEL> R -> <VOWEL> RX
    // Example: ART


    // If vowel flag is set change R to RX
    A = flags[A] & 128;

    if (A != 0) phonemeindex[pos] = 18;  // 'RX'

    // continue to next phoneme
    pos++;
    continue;

pos41611:

    // RULE:
    //       <VOWEL> L -> <VOWEL> LX
    // Example: ALL

    // Is phoneme L?
    if (A == 24)    // 'L'
    {
      // If prior phoneme does not have VOWEL flag set, move to next phoneme
      if ((flags[phonemeindex[pos - 1]] & 128) == 0) {
        pos++;
        continue;
      }
      // Prior phoneme has VOWEL flag set, so change L to LX and move to next phoneme

      phonemeindex[X] = 19;     // 'LX'
      pos++;
      continue;
    }

    // RULE:
    //       G S -> G Z
    //
    // Can't get to fire -
    //       1. The G -> GX rule intervenes
    //       2. Reciter already replaces GS -> GZ

    // Is current phoneme S?
    if (A == 32)    // 'S'
    {
      // If prior phoneme is not G, move to next phoneme
      if (phonemeindex[pos - 1] != 60) {
        pos++;
        continue;
      }
      // Replace S with Z and move on

      phonemeindex[pos] = 38;    // 'Z'
      pos++;
      continue;
    }

    // RULE:
    //             K <VOWEL OR DIPHTONG NOT ENDING WITH IY> -> KX <VOWEL OR DIPHTONG NOT ENDING WITH IY>
    // Example: COW

    // Is current phoneme K?
    if (A == 72)    // 'K'
    {
      // Get next phoneme
      Y = phonemeindex[pos + 1];
      // If at end, replace current phoneme with KX
      if (Y == 255) phonemeindex[pos] = 75; // ML : prevents an index out of bounds problem
      else
      {
        // VOWELS AND DIPHTONGS ENDING WITH IY SOUND flag set?
        A = flags[Y] & 32;

        // Replace with KX
        if (A == 0) phonemeindex[pos] = 75;  // 'KX'
      }
    }
    else

      // RULE:
      //             G <VOWEL OR DIPHTONG NOT ENDING WITH IY> -> GX <VOWEL OR DIPHTONG NOT ENDING WITH IY>
      // Example: GO


      // Is character a G?
      if (A == 60)   // 'G'
      {
        // Get the following character
        unsigned char index = phonemeindex[pos + 1];

        // At end of buffer?
        if (index == 255) //prevent buffer overflow
        {
          pos++; continue;
        }
        else
          // If diphtong ending with YX, move continue processing next phoneme
          if ((flags[index] & 32) != 0) {
            pos++;
            continue;
          }
        // replace G with GX and continue processing next phoneme

        phonemeindex[pos] = 63; // 'GX'
        pos++;
        continue;
      }

    // RULE:
    //      S P -> S B
    //      S T -> S D
    //      S K -> S G
    //      S KX -> S GX
    // Examples: SPY, STY, SKY, SCOWL

    Y = phonemeindex[pos];
    //pos41719:
    // Replace with softer version?
    A = flags[Y] & 1;
    if (A == 0) goto pos41749;
    A = phonemeindex[pos - 1];
    if (A != 32)    // 'S'
    {
      A = Y;
      goto pos41812;
    }
    // Replace with softer version

    phonemeindex[pos] = Y - 12;
    pos++;
    continue;


pos41749:

    // RULE:
    //      <ALVEOLAR> UW -> <ALVEOLAR> UX
    //
    // Example: NEW, DEW, SUE, ZOO, THOO, TOO

    //       UW -> UX

    A = phonemeindex[X];
    if (A == 53)    // 'UW'
    {
      // ALVEOLAR flag set?
      Y = phonemeindex[X - 1];
      A = flags2[Y] & 4;
      // If not set, continue processing next phoneme
      if (A == 0) {
        pos++;
        continue;
      }

      phonemeindex[X] = 16;
      pos++;
      continue;
    }
pos41779:

    // RULE:
    //       CH -> CH CH' (CH requires two phonemes to represent it)
    // Example: CHEW

