dretay/stm32f103cb_alarm_clock/Core/Src/STM32SAM.c
    }


    // WH, R*, L*, W*, Y*, M*, N*, NX, Q*, Z*, ZH, V*, DH, J*, B*, D*, G*, GX

    //pos48821:

    // RULE: <NASAL> <STOP CONSONANT>
    //       Set punctuation length to 6
    //       Set stop consonant length to 5

    // nasal?
    if ((flags2[index] & 8) != 0)
    {

      // M*, N*, NX,

      // get the next phoneme
      X++;
      index = phonemeindex[X];

      // end of buffer?
      if (index == 255)
        A = 65 & 2; //prevent buffer overflow
      else
        A = flags[index] & 2; // check for stop consonant


      // is next phoneme a stop consonant?
      if (A != 0)

        // B*, D*, G*, GX, P*, T*, K*, KX

      {


        // set stop consonant length to 6
        phonemeLength[X] = 6;

        // set nasal length to 5
        phonemeLength[X - 1] = 5;



      }
      // move to next phoneme
      loopIndex++;
      continue;
    }


    // WH, R*, L*, W*, Y*, Q*, Z*, ZH, V*, DH, J*, B*, D*, G*, GX

    // RULE: <VOICED STOP CONSONANT> {optional silence} <STOP CONSONANT>
    //       Shorten both to (length/2 + 1)

    // (voiced) stop consonant?
    if ((flags[index] & 2) != 0)
    {
      // B*, D*, G*, GX

      // move past silence
      do
      {
        // move ahead
        X++;
        index = phonemeindex[X];
      } while (index == 0);


      // check for end of buffer
      if (index == 255) //buffer overflow
      {
        // ignore, overflow code
        if ((65 & 2) == 0) {
          loopIndex++;
          continue;
        }
      } else if ((flags[index] & 2) == 0) {
        // if another stop consonant, move ahead
        loopIndex++;
        continue;
      }

      // RULE: <UNVOICED STOP CONSONANT> {optional silence} <STOP CONSONANT>


      // X gets overwritten, so hold prior X value for debug statement
      int debugX = X;
      // shorten the prior phoneme length to (length/2 + 1)
      phonemeLength[X] = (phonemeLength[X] >> 1) + 1;
      X = loopIndex;

      // also shorten this phoneme length to (length/2 +1)
      phonemeLength[loopIndex] = (phonemeLength[loopIndex] >> 1) + 1;




      // move ahead
      loopIndex++;
      continue;
    }


    // WH, R*, L*, W*, Y*, Q*, Z*, ZH, V*, DH, J*, **,

    // RULE: <VOICED NON-VOWEL> <DIPHTONG>
    //       Decrease <DIPHTONG> by 2

    // liquic consonant?
    if ((flags2[index] & 16) != 0)
    {
      // R*, L*, W*, Y*

      // get the prior phoneme
      index = phonemeindex[X - 1];

      // prior phoneme a stop consonant>
      if ((flags[index] & 2) != 0) {
        // Rule: <LIQUID CONSONANT> <DIPHTONG>


        // decrease the phoneme length by 2 frames (20 ms)
        phonemeLength[X] -= 2;


      }
    }

    // move to next phoneme
    loopIndex++;
    continue;
  }
  //            goto pos48701;
}




// -------------------------------------------------------------------------
// ML : Code47503 is division with remainder, and mem50 gets the sign
static void Code47503(unsigned char mem52)
{

  Y = 0;
  if ((mem53 & 128) != 0)
  {
    mem53 = -mem53;
    Y = 128;
  }
  mem50 = Y;
  A = 0;
  for (X = 8; X > 0; X--)
  {
    int temp = mem53;
    mem53 = mem53 << 1;
    A = A << 1;
    if (temp >= 128) A++;
    if (A >= mem52)
    {
      A = A - mem52;
      mem53++;
    }
  }

  mem51 = A;
  if ((mem50 & 128) != 0) mem53 = -mem53;

}




////////////////////////////////////////////////////////////////////////////////////////////
//
//           Reciter
//
////////////////////////////////////////////////////////////////////////////////////////////


static void Code37055(unsigned char mem59)
{
  X = mem59;
  X--;
  A = inputtemp[X];
  Y = A;
  A = tab36376[Y];
  return;
}




static void Code37066(unsigned char mem58)
{
  X = mem58;
  X++;
  A = inputtemp[X];
  Y = A;
  A = tab36376[Y];
}




static unsigned char GetRuleByte(unsigned short mem62, unsigned char Y)
{
  unsigned int address = mem62;

  if (mem62 >= 37541)
  {
    address -= 37541;
    return rules2[address + Y];
  }
  address -= 32000;
  return rules[address + Y];
}







static int TextToPhonemes(unsigned char *input) // Code36484
{
  //unsigned char *tab39445 = &mem[39445];   //input and output
  //unsigned char mem29;
  unsigned char mem56;      //output position for phonemes
  unsigned char mem57;
  unsigned char mem58;
  unsigned char mem59;
  unsigned char mem60;
  unsigned char mem61;
  unsigned short mem62;     // memory position of current rule

  unsigned char mem64;      // position of '=' or current character
  unsigned char mem65;     // position of ')'
  unsigned char mem66;     // position of '('
  unsigned char mem36653;

  inputtemp[0] = 32;

  // secure copy of input
  // because input will be overwritten by phonemes
  X = 1;
  Y = 0;
  do
  {
    //pos36499:
    A = input[Y] & 127;
    if ( A >= 112) A = A & 95;
    else if ( A >= 96) A = A & 79;

    inputtemp[X] = A;
    X++;
    Y++;
  } while (Y != 255);


  X = 255;
  inputtemp[X] = 27;
  mem61 = 255;


pos36550:
  A = 255;
  mem56 = 255;


pos36554:
  while (1)
  {
    mem61++;
    X = mem61;
    A = inputtemp[X];
    mem64 = A;
    if (A == '[')
    {
      mem56++;
      X = mem56;
      A = 155;
      input[X] = 155;
      //goto pos36542;
      //          Code39771();    //Code39777();
      return 1;
    }

    //pos36579:
    if (A != '.') break;
    X++;
    Y = inputtemp[X];
    A = tab36376[Y] & 1;
    if (A != 0) break;
    mem56++;
    X = mem56;
    A = '.';
    input[X] = '.';
  } //while


  //pos36607:
  A = mem64;
  Y = A;
  A = tab36376[A];
  mem57 = A;
  if ((A & 2) != 0)
  {
    mem62 = 37541;
    goto pos36700;
  }

  //pos36630:
  A = mem57;
  if (A != 0) goto pos36677;
  A = 32;
  inputtemp[X] = ' ';
  mem56++;
  X = mem56;
  if (X > 120) goto pos36654;
  input[X] = A;
  goto pos36554;

  // -----

  //36653 is unknown. Contains position

pos36654:
  input[X] = 155;
  A = mem61;
  mem36653 = A;
  //  mem29 = A; // not used
  //  Code36538(); das ist eigentlich
  return 1;
  //Code39771();
  //go on if there is more input ???
  mem61 = mem36653;
  goto pos36550;

pos36677:
  A = mem57 & 128;
  if (A == 0)
  {
    //36683: BRK
    return 0;
  }

  // go to the right rules for this character.
  X = mem64 - 'A';
  mem62 = tab37489[X] | (tab37515[X] << 8);

  // -------------------------------------
  // go to next rule
  // -------------------------------------

pos36700:

