dretay/stm32f103cb_alarm_clock/Core/Src/STM32SAM.c
  STM32SAM_SPEED = STM32SAM_SPEED & 0x1f; // limit it from 0 to 31


  _STM32SAM_SPEED = STM32SAM_SPEED;



  // set default voice

  speed = 72;
  pitch = 64;
  mouth = 128;
  throat = 128;

  phonetic = 0;
  singmode = 0;

  wait1 = 7;
  wait2 = 6;

  mem59 = 0;


  oldtimetableindex = 0;

  HAL_TIM_PWM_Start(&htim1, TIM_CHANNEL_1);


}



////////////////////////////////////////////////////////////////////////////////////////////
//
//           STM32SAM sam  (variable string,  phonetic, sing, pitch, speed, mouth, throat)
//           STM32SAM say (sing off, phonetic off) (const string)
//           STM32SAM say (sing off, phonetic off) (variable string)
//           STM32SAM sing (sing on, phonetic off) (const string)
//           STM32SAM sing (sing on, phonetic off) (variable string)
//           STM32SAM sayPhonetic (sing off, phonetic on) (const string)
//           STM32SAM sayPhonetic (sing off, phonetic on) (variable string)
//           STM32SAM singPhonetic (sing on, phonetic on) (const string)
//           STM32SAM singPhonetic (sing on, phonetic on) (variable string)
//           STM32SAM voice (pitch, speed, mouth, throat)
//           STM32SAM setPitch (pitch)
//           STM32SAM setSpeed (speed)
//           STM32SAM setMouth (mouth)
//           STM32SAM setThroat (throat)
//
//
////////////////////////////////////////////////////////////////////////////////////////////



////////////////////////////////////////////////////////////////////////////////////////////
//
//           STM32SAM sam  (const string,  phonetic, sing, pitch, speed, mouth, throat)
//
////////////////////////////////////////////////////////////////////////////////////////////


static void sam ( const char *argv, unsigned char _phonetic , unsigned char _singmode , unsigned char _pitch , unsigned char _speed , unsigned char  _mouth , unsigned char _throat  ) {


  phonetic = _phonetic;
  singmode = _singmode;
  pitch = _pitch;
  speed = _speed;
  mouth = _mouth;
  throat = _throat;


  int i;

  for (i = 0; i < 256; i++) {
    input[i] = argv[i];
  }



  for (i = 0; input[i] != 0; i++) {

    if (i != 0) {
      input[i] = toupper((int)argv[i]);
    }

  }


  if (!phonetic)
  {
    strncat(input, "[", 256);
    if (!TextToPhonemes((unsigned char *)input)) {
      // PrintUsage();
      return ;
    }


  }
  else {
    strncat(input, "\x9b", 256);
  }

  SetInput(input);

  if (!SAMMain())
  {
    return ;
  }

}



////////////////////////////////////////////////////////////////////////////////////////////
//
//           STM32SAM say(sing off, phonetic off) (const string)
//
////////////////////////////////////////////////////////////////////////////////////////////


static void say(const char *argv ) {

  int i;

  phonetic = 0;
  singmode = 0;

  char const_input[256];


  for (i = 0; i < 256; i++) {
    const_input[i] = argv[i];
  }

  sam ( const_input,   phonetic ,  singmode ,  pitch , speed ,  mouth , throat  );


}


////////////////////////////////////////////////////////////////////////////////////////////
//
//           STM32SAM sing (sing on, phonetic off)
//
////////////////////////////////////////////////////////////////////////////////////////////


static void sing (const char *argv ) {

  int i;

  phonetic = 0;
  singmode = 1;

  char const_input[256];


  for (i = 0; i < 256; i++) {
    const_input[i] = argv[i];
  }

  sam ( const_input,   phonetic ,  singmode ,  pitch , speed ,  mouth , throat  );


}


////////////////////////////////////////////////////////////////////////////////////////////
//
//           STM32SAM sayPhonetic (sing off, phonetic on)
//
////////////////////////////////////////////////////////////////////////////////////////////

static void sayPhonetic (const char *argv ) {

  int i;

  phonetic = 1;
  singmode = 0;

  char const_input[256];


  for (i = 0; i < 256; i++) {
    const_input[i] = argv[i];
  }

  sam ( const_input,   phonetic ,  singmode ,  pitch , speed ,  mouth , throat  );


}

////////////////////////////////////////////////////////////////////////////////////////////
//
//           STM32SAM singPhonetic (sing on, phonetic on)
//
////////////////////////////////////////////////////////////////////////////////////////////

static void singPhonetic (const char *argv ) {

  int i;

  phonetic = 1;
  singmode = 1;

  char const_input[256];


  for (i = 0; i < 256; i++) {
    const_input[i] = argv[i];
  }

  sam ( const_input,   phonetic ,  singmode ,  pitch , speed ,  mouth , throat  );


}



////////////////////////////////////////////////////////////////////////////////////////////
//
//           STM32SAM voice (pitch, speed, mouth, throat)
//
////////////////////////////////////////////////////////////////////////////////////////////

static void setVoice(unsigned char _pitch /* = 64 */, unsigned char _speed /* = 72 */ , unsigned char  _mouth /* = 128 */ , unsigned char _throat /* = 128 */) {

  pitch = _pitch;
  speed = _speed;
  mouth = _mouth;
  throat = _throat;

}

////////////////////////////////////////////////////////////////////////////////////////////
//
//           STM32SAM setPitch (pitch)
//
////////////////////////////////////////////////////////////////////////////////////////////


static void setPitch(unsigned char _pitch /* = 64 */) {

  pitch = _pitch;

}
////////////////////////////////////////////////////////////////////////////////////////////
//
//           STM32SAM setSpeed (speed)
//
////////////////////////////////////////////////////////////////////////////////////////////

static void setSpeed( unsigned char _speed /* = 72 */) {

  speed = _speed;

}
////////////////////////////////////////////////////////////////////////////////////////////
//
//           STM32SAM setMouth (mouth)
//
////////////////////////////////////////////////////////////////////////////////////////////

static void setMouth(unsigned char  _mouth /* = 128 */) {

  mouth = _mouth;

}


////////////////////////////////////////////////////////////////////////////////////////////
//
//           STM32SAM setThroat (throat)
//
////////////////////////////////////////////////////////////////////////////////////////////


static void setThroat( unsigned char _throat /* = 128 */) {

  throat = _throat;

}
////////////////////////////////////////////////////////////////////////////////////////////
//
//           Hardware
//
////////////////////////////////////////////////////////////////////////////////////////////
// Hardware specifics, for easier porting to other microcontrollers

//
// Set PA8 pin as PWM, at 256 timer ticks overflow (8bit resolution)




static inline void SetAUDIO(unsigned char main_volume) {
	__HAL_TIM_SET_COMPARE(&htim1, TIM_CHANNEL_1, main_volume);
}

const struct stm32sam STM32SAM = {
		.init = init,
	    .sam = sam,
	    .say = say,
	    .sing = sing,
	    .sayPhonetic = sayPhonetic,
	    .singPhonetic = singPhonetic,
	    .setVoice = setVoice,
	    .setPitch = setPitch,
	    .setSpeed = setSpeed,
	    .setMouth = setMouth,
	    .setThroat =setThroat,
};
